{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loading File: CleanWikiDump_part451.json\n",
      "Loading File: CleanWikiDump_part308.json\n",
      "Loading File: CleanWikiDump_part190.json\n",
      "Loading File: CleanWikiDump_part431.json\n",
      "Loading File: CleanWikiDump_part111.json\n",
      "Loading File: CleanWikiDump_part182.json\n",
      "Loading File: CleanWikiDump_part181.json\n",
      "Loading File: CleanWikiDump_part109.json\n",
      "Loading File: CleanWikiDump_part110.json\n",
      "Loading File: CleanWikiDump_part367.json\n",
      "Loading File: CleanWikiDump_part342.json\n",
      "Loading File: CleanWikiDump_part276.json\n",
      "Loading File: CleanWikiDump_part449.json\n",
      "Loading File: CleanWikiDump_part447.json\n",
      "Loading File: CleanWikiDump_part437.json\n",
      "Loading File: CleanWikiDump_part189.json\n",
      "Loading File: CleanWikiDump_part450.json\n",
      "Loading File: CleanWikiDump_part448.json\n",
      "Loading File: CleanWikiDump_part364.json\n",
      "Loading File: CleanWikiDump_part307.json\n",
      "Loading File: CleanWikiDump_part363.json\n",
      "Loading File: CleanWikiDump_part343.json\n",
      "Loading File: CleanWikiDump_part445.json\n",
      "Loading File: CleanWikiDump_part446.json\n",
      "Loading File: CleanWikiDump_part432.json\n",
      "Loading File: CleanWikiDump_part311.json\n",
      "Loading File: CleanWikiDump_part439.json\n",
      "Loading File: CleanWikiDump_part444.json\n",
      "Loading File: CleanWikiDump_part401.json\n",
      "Loading File: CleanWikiDump_part438.json\n",
      "Loading File: CleanWikiDump_part150.json\n",
      "Loading File: CleanWikiDump_part428.json\n",
      "Loading File: CleanWikiDump_part235.json\n",
      "Loading File: CleanWikiDump_part443.json\n",
      "Loading File: CleanWikiDump_part219.json\n",
      "Loading File: CleanWikiDump_part365.json\n",
      "Loading File: CleanWikiDump_part433.json\n",
      "Loading File: CleanWikiDump_part414.json\n",
      "Loading File: CleanWikiDump_part441.json\n",
      "Loading File: CleanWikiDump_part315.json\n",
      "Loading File: CleanWikiDump_part442.json\n",
      "Loading File: CleanWikiDump_part434.json\n",
      "Loading File: CleanWikiDump_part389.json\n",
      "Loading File: CleanWikiDump_part321.json\n",
      "Loading File: CleanWikiDump_part416.json\n",
      "Loading File: CleanWikiDump_part188.json\n",
      "Loading File: CleanWikiDump_part403.json\n",
      "Loading File: CleanWikiDump_part314.json\n",
      "Loading File: CleanWikiDump_part309.json\n",
      "Loading File: CleanWikiDump_part426.json\n",
      "Loading File: CleanWikiDump_part427.json\n",
      "Loading File: CleanWikiDump_part435.json\n",
      "Loading File: CleanWikiDump_part329.json\n",
      "Loading File: CleanWikiDump_part436.json\n",
      "Loading File: CleanWikiDump_part340.json\n",
      "Loading File: CleanWikiDump_part220.json\n",
      "Loading File: CleanWikiDump_part395.json\n",
      "Loading File: CleanWikiDump_part429.json\n",
      "Loading File: CleanWikiDump_part415.json\n",
      "Loading File: CleanWikiDump_part391.json\n",
      "Loading File: CleanWikiDump_part440.json\n",
      "Loading File: CleanWikiDump_part421.json\n",
      "Loading File: CleanWikiDump_part305.json\n",
      "Loading File: CleanWikiDump_part378.json\n",
      "Loading File: CleanWikiDump_part377.json\n",
      "Loading File: CleanWikiDump_part396.json\n",
      "Loading File: CleanWikiDump_part128.json\n",
      "Loading File: CleanWikiDump_part310.json\n",
      "Loading File: CleanWikiDump_part385.json\n",
      "Loading File: CleanWikiDump_part366.json\n",
      "Loading File: CleanWikiDump_part430.json\n",
      "Loading File: CleanWikiDump_part404.json\n",
      "Loading File: CleanWikiDump_part394.json\n",
      "Loading File: CleanWikiDump_part330.json\n",
      "Loading File: CleanWikiDump_part402.json\n",
      "Loading File: CleanWikiDump_part390.json\n",
      "Loading File: CleanWikiDump_part397.json\n",
      "Loading File: CleanWikiDump_part175.json\n",
      "Loading File: CleanWikiDump_part337.json\n",
      "Loading File: CleanWikiDump_part412.json\n",
      "Loading File: CleanWikiDump_part413.json\n",
      "Loading File: CleanWikiDump_part410.json\n",
      "Loading File: CleanWikiDump_part338.json\n",
      "Loading File: CleanWikiDump_part411.json\n",
      "Loading File: CleanWikiDump_part384.json\n",
      "Loading File: CleanWikiDump_part425.json\n",
      "Loading File: CleanWikiDump_part420.json\n",
      "Loading File: CleanWikiDump_part393.json\n",
      "Loading File: CleanWikiDump_part373.json\n",
      "Loading File: CleanWikiDump_part376.json\n",
      "Loading File: CleanWikiDump_part419.json\n",
      "Loading File: CleanWikiDump_part245.json\n",
      "Loading File: CleanWikiDump_part417.json\n",
      "Loading File: CleanWikiDump_part405.json\n",
      "Loading File: CleanWikiDump_part381.json\n",
      "Loading File: CleanWikiDump_part097.json\n",
      "Loading File: CleanWikiDump_part244.json\n",
      "Loading File: CleanWikiDump_part392.json\n",
      "Loading File: CleanWikiDump_part371.json\n",
      "Loading File: CleanWikiDump_part350.json\n",
      "Loading File: CleanWikiDump_part398.json\n",
      "Loading File: CleanWikiDump_part388.json\n",
      "Loading File: CleanWikiDump_part372.json\n",
      "Loading File: CleanWikiDump_part240.json\n",
      "Loading File: CleanWikiDump_part328.json\n",
      "Loading File: CleanWikiDump_part370.json\n",
      "Loading File: CleanWikiDump_part246.json\n",
      "Loading File: CleanWikiDump_part322.json\n",
      "Loading File: CleanWikiDump_part358.json\n",
      "Loading File: CleanWikiDump_part129.json\n",
      "Loading File: CleanWikiDump_part418.json\n",
      "Loading File: CleanWikiDump_part326.json\n",
      "Loading File: CleanWikiDump_part331.json\n",
      "Loading File: CleanWikiDump_part424.json\n",
      "Loading File: CleanWikiDump_part325.json\n",
      "Loading File: CleanWikiDump_part422.json\n",
      "Loading File: CleanWikiDump_part149.json\n",
      "Loading File: CleanWikiDump_part191.json\n",
      "Loading File: CleanWikiDump_part290.json\n",
      "Loading File: CleanWikiDump_part408.json\n",
      "Loading File: CleanWikiDump_part303.json\n",
      "Loading File: CleanWikiDump_part336.json\n",
      "Loading File: CleanWikiDump_part347.json\n",
      "Loading File: CleanWikiDump_part339.json\n",
      "Loading File: CleanWikiDump_part356.json\n",
      "Loading File: CleanWikiDump_part387.json\n",
      "Loading File: CleanWikiDump_part344.json\n",
      "Loading File: CleanWikiDump_part374.json\n",
      "Loading File: CleanWikiDump_part332.json\n",
      "Loading File: CleanWikiDump_part333.json\n",
      "Loading File: CleanWikiDump_part368.json\n",
      "Loading File: CleanWikiDump_part318.json\n",
      "Loading File: CleanWikiDump_part348.json\n",
      "Loading File: CleanWikiDump_part199.json\n",
      "Loading File: CleanWikiDump_part327.json\n",
      "Loading File: CleanWikiDump_part375.json\n",
      "Loading File: CleanWikiDump_part204.json\n",
      "Loading File: CleanWikiDump_part386.json\n",
      "Loading File: CleanWikiDump_part218.json\n",
      "Loading File: CleanWikiDump_part242.json\n",
      "Loading File: CleanWikiDump_part208.json\n",
      "Loading File: CleanWikiDump_part112.json\n",
      "Loading File: CleanWikiDump_part407.json\n",
      "Loading File: CleanWikiDump_part247.json\n",
      "Loading File: CleanWikiDump_part172.json\n",
      "Loading File: CleanWikiDump_part275.json\n",
      "Loading File: CleanWikiDump_part222.json\n",
      "Loading File: CleanWikiDump_part353.json\n",
      "Loading File: CleanWikiDump_part380.json\n",
      "Loading File: CleanWikiDump_part359.json\n",
      "Loading File: CleanWikiDump_part345.json\n",
      "Loading File: CleanWikiDump_part294.json\n",
      "Loading File: CleanWikiDump_part269.json\n",
      "Loading File: CleanWikiDump_part423.json\n",
      "Loading File: CleanWikiDump_part382.json\n",
      "Loading File: CleanWikiDump_part101.json\n",
      "Loading File: CleanWikiDump_part287.json\n",
      "Loading File: CleanWikiDump_part231.json\n",
      "Loading File: CleanWikiDump_part286.json\n",
      "Loading File: CleanWikiDump_part383.json\n",
      "Loading File: CleanWikiDump_part255.json\n",
      "Loading File: CleanWikiDump_part292.json\n",
      "Loading File: CleanWikiDump_part400.json\n",
      "Loading File: CleanWikiDump_part324.json\n",
      "Loading File: CleanWikiDump_part319.json\n",
      "Loading File: CleanWikiDump_part300.json\n",
      "Loading File: CleanWikiDump_part335.json\n",
      "Loading File: CleanWikiDump_part362.json\n",
      "Loading File: CleanWikiDump_part369.json\n",
      "Loading File: CleanWikiDump_part334.json\n",
      "Loading File: CleanWikiDump_part352.json\n",
      "Loading File: CleanWikiDump_part346.json\n",
      "Loading File: CleanWikiDump_part293.json\n",
      "Loading File: CleanWikiDump_part357.json\n",
      "Loading File: CleanWikiDump_part237.json\n",
      "Loading File: CleanWikiDump_part320.json\n",
      "Loading File: CleanWikiDump_part379.json\n",
      "Loading File: CleanWikiDump_part243.json\n",
      "Loading File: CleanWikiDump_part143.json\n",
      "Loading File: CleanWikiDump_part177.json\n",
      "Loading File: CleanWikiDump_part291.json\n",
      "Loading File: CleanWikiDump_part272.json\n",
      "Loading File: CleanWikiDump_part288.json\n",
      "Loading File: CleanWikiDump_part409.json\n",
      "Loading File: CleanWikiDump_part349.json\n",
      "Loading File: CleanWikiDump_part295.json\n",
      "Loading File: CleanWikiDump_part236.json\n",
      "Loading File: CleanWikiDump_part206.json\n",
      "Loading File: CleanWikiDump_part254.json\n",
      "Loading File: CleanWikiDump_part360.json\n",
      "Loading File: CleanWikiDump_part361.json\n",
      "Loading File: CleanWikiDump_part298.json\n",
      "Loading File: CleanWikiDump_part241.json\n",
      "Loading File: CleanWikiDump_part406.json\n",
      "Loading File: CleanWikiDump_part280.json\n",
      "Loading File: CleanWikiDump_part351.json\n",
      "Loading File: CleanWikiDump_part207.json\n",
      "Loading File: CleanWikiDump_part304.json\n",
      "Loading File: CleanWikiDump_part234.json\n",
      "Loading File: CleanWikiDump_part296.json\n",
      "Loading File: CleanWikiDump_part233.json\n",
      "Loading File: CleanWikiDump_part228.json\n",
      "Loading File: CleanWikiDump_part301.json\n",
      "Loading File: CleanWikiDump_part226.json\n",
      "Loading File: CleanWikiDump_part297.json\n",
      "Loading File: CleanWikiDump_part355.json\n",
      "Loading File: CleanWikiDump_part209.json\n",
      "Loading File: CleanWikiDump_part256.json\n",
      "Loading File: CleanWikiDump_part186.json\n",
      "Loading File: CleanWikiDump_part399.json\n",
      "Loading File: CleanWikiDump_part266.json\n",
      "Loading File: CleanWikiDump_part284.json\n",
      "Loading File: CleanWikiDump_part265.json\n",
      "Loading File: CleanWikiDump_part271.json\n",
      "Loading File: CleanWikiDump_part227.json\n",
      "Loading File: CleanWikiDump_part187.json\n",
      "Loading File: CleanWikiDump_part211.json\n",
      "Loading File: CleanWikiDump_part176.json\n",
      "Loading File: CleanWikiDump_part354.json\n",
      "Loading File: CleanWikiDump_part215.json\n",
      "Loading File: CleanWikiDump_part262.json\n",
      "Loading File: CleanWikiDump_part210.json\n",
      "Loading File: CleanWikiDump_part313.json\n",
      "Loading File: CleanWikiDump_part230.json\n",
      "Loading File: CleanWikiDump_part316.json\n",
      "Loading File: CleanWikiDump_part193.json\n",
      "Loading File: CleanWikiDump_part312.json\n",
      "Loading File: CleanWikiDump_part317.json\n",
      "Loading File: CleanWikiDump_part263.json\n",
      "Loading File: CleanWikiDump_part259.json\n",
      "Loading File: CleanWikiDump_part279.json\n",
      "Loading File: CleanWikiDump_part217.json\n",
      "Loading File: CleanWikiDump_part213.json\n",
      "Loading File: CleanWikiDump_part164.json\n",
      "Loading File: CleanWikiDump_part270.json\n",
      "Loading File: CleanWikiDump_part106.json\n",
      "Loading File: CleanWikiDump_part277.json\n",
      "Loading File: CleanWikiDump_part299.json\n",
      "Loading File: CleanWikiDump_part221.json\n",
      "Loading File: CleanWikiDump_part285.json\n",
      "Loading File: CleanWikiDump_part323.json\n",
      "Loading File: CleanWikiDump_part264.json\n",
      "Loading File: CleanWikiDump_part162.json\n",
      "Loading File: CleanWikiDump_part214.json\n",
      "Loading File: CleanWikiDump_part104.json\n",
      "Loading File: CleanWikiDump_part100.json\n",
      "Loading File: CleanWikiDump_part302.json\n",
      "Loading File: CleanWikiDump_part274.json\n",
      "Loading File: CleanWikiDump_part148.json\n",
      "Loading File: CleanWikiDump_part108.json\n",
      "Loading File: CleanWikiDump_part253.json\n",
      "Loading File: CleanWikiDump_part278.json\n",
      "Loading File: CleanWikiDump_part281.json\n",
      "Loading File: CleanWikiDump_part289.json\n",
      "Loading File: CleanWikiDump_part341.json\n",
      "Loading File: CleanWikiDump_part238.json\n",
      "Loading File: CleanWikiDump_part202.json\n",
      "Loading File: CleanWikiDump_part268.json\n",
      "Loading File: CleanWikiDump_part203.json\n",
      "Loading File: CleanWikiDump_part252.json\n",
      "Loading File: CleanWikiDump_part223.json\n",
      "Loading File: CleanWikiDump_part282.json\n",
      "Loading File: CleanWikiDump_part229.json\n",
      "Loading File: CleanWikiDump_part267.json\n",
      "Loading File: CleanWikiDump_part153.json\n",
      "Loading File: CleanWikiDump_part232.json\n",
      "Loading File: CleanWikiDump_part147.json\n",
      "Loading File: CleanWikiDump_part216.json\n",
      "Loading File: CleanWikiDump_part258.json\n",
      "Loading File: CleanWikiDump_part273.json\n",
      "Loading File: CleanWikiDump_part180.json\n",
      "Loading File: CleanWikiDump_part144.json\n",
      "Loading File: CleanWikiDump_part171.json\n",
      "Loading File: CleanWikiDump_part306.json\n",
      "Loading File: CleanWikiDump_part250.json\n",
      "Loading File: CleanWikiDump_part260.json\n",
      "Loading File: CleanWikiDump_part251.json\n",
      "Loading File: CleanWikiDump_part212.json\n",
      "Loading File: CleanWikiDump_part173.json\n",
      "Loading File: CleanWikiDump_part196.json\n",
      "Loading File: CleanWikiDump_part192.json\n",
      "Loading File: CleanWikiDump_part119.json\n",
      "Loading File: CleanWikiDump_part183.json\n",
      "Loading File: CleanWikiDump_part283.json\n",
      "Loading File: CleanWikiDump_part248.json\n",
      "Loading File: CleanWikiDump_part103.json\n",
      "Loading File: CleanWikiDump_part170.json\n",
      "Loading File: CleanWikiDump_part257.json\n",
      "Loading File: CleanWikiDump_part134.json\n",
      "Loading File: CleanWikiDump_part118.json\n",
      "Loading File: CleanWikiDump_part092.json\n",
      "Loading File: CleanWikiDump_part194.json\n",
      "Loading File: CleanWikiDump_part197.json\n",
      "Loading File: CleanWikiDump_part178.json\n",
      "Loading File: CleanWikiDump_part163.json\n",
      "Loading File: CleanWikiDump_part184.json\n",
      "Loading File: CleanWikiDump_part142.json\n",
      "Loading File: CleanWikiDump_part093.json\n",
      "Loading File: CleanWikiDump_part261.json\n",
      "Loading File: CleanWikiDump_part174.json\n",
      "Loading File: CleanWikiDump_part160.json\n",
      "Loading File: CleanWikiDump_part249.json\n",
      "Loading File: CleanWikiDump_part167.json\n",
      "Loading File: CleanWikiDump_part151.json\n",
      "Loading File: CleanWikiDump_part205.json\n",
      "Loading File: CleanWikiDump_part198.json\n",
      "Loading File: CleanWikiDump_part239.json\n",
      "Loading File: CleanWikiDump_part158.json\n",
      "Loading File: CleanWikiDump_part179.json\n",
      "Loading File: CleanWikiDump_part169.json\n",
      "Loading File: CleanWikiDump_part090.json\n",
      "Loading File: CleanWikiDump_part161.json\n",
      "Loading File: CleanWikiDump_part201.json\n",
      "Loading File: CleanWikiDump_part154.json\n",
      "Loading File: CleanWikiDump_part141.json\n",
      "Loading File: CleanWikiDump_part157.json\n",
      "Loading File: CleanWikiDump_part225.json\n",
      "Loading File: CleanWikiDump_part132.json\n",
      "Loading File: CleanWikiDump_part131.json\n",
      "Loading File: CleanWikiDump_part185.json\n",
      "Loading File: CleanWikiDump_part224.json\n",
      "Loading File: CleanWikiDump_part120.json\n",
      "Loading File: CleanWikiDump_part139.json\n",
      "Loading File: CleanWikiDump_part156.json\n",
      "Loading File: CleanWikiDump_part145.json\n",
      "Loading File: CleanWikiDump_part130.json\n",
      "Loading File: CleanWikiDump_part127.json\n",
      "Loading File: CleanWikiDump_part116.json\n",
      "Loading File: CleanWikiDump_part081.json\n",
      "Loading File: CleanWikiDump_part114.json\n",
      "Loading File: CleanWikiDump_part166.json\n",
      "Loading File: CleanWikiDump_part099.json\n",
      "Loading File: CleanWikiDump_part155.json\n",
      "Loading File: CleanWikiDump_part200.json\n",
      "Loading File: CleanWikiDump_part113.json\n",
      "Loading File: CleanWikiDump_part105.json\n",
      "Loading File: CleanWikiDump_part123.json\n",
      "Loading File: CleanWikiDump_part133.json\n",
      "Loading File: CleanWikiDump_part121.json\n",
      "Loading File: CleanWikiDump_part138.json\n",
      "Loading File: CleanWikiDump_part095.json\n",
      "Loading File: CleanWikiDump_part091.json\n",
      "Loading File: CleanWikiDump_part137.json\n",
      "Loading File: CleanWikiDump_part117.json\n",
      "Loading File: CleanWikiDump_part165.json\n",
      "Loading File: CleanWikiDump_part146.json\n",
      "Loading File: CleanWikiDump_part152.json\n",
      "Loading File: CleanWikiDump_part107.json\n",
      "Loading File: CleanWikiDump_part125.json\n",
      "Loading File: CleanWikiDump_part136.json\n",
      "Loading File: CleanWikiDump_part102.json\n",
      "Loading File: CleanWikiDump_part115.json\n",
      "Loading File: CleanWikiDump_part096.json\n",
      "Loading File: CleanWikiDump_part122.json\n",
      "Loading File: CleanWikiDump_part086.json\n",
      "Loading File: CleanWikiDump_part168.json\n",
      "Loading File: CleanWikiDump_part058.json\n",
      "Loading File: CleanWikiDump_part126.json\n",
      "Loading File: CleanWikiDump_part140.json\n",
      "Loading File: CleanWikiDump_part094.json\n",
      "Loading File: CleanWikiDump_part135.json\n",
      "Loading File: CleanWikiDump_part124.json\n",
      "Loading File: CleanWikiDump_part195.json\n",
      "Loading File: CleanWikiDump_part083.json\n",
      "Loading File: CleanWikiDump_part085.json\n",
      "Loading File: CleanWikiDump_part089.json\n",
      "Loading File: CleanWikiDump_part082.json\n",
      "Loading File: CleanWikiDump_part088.json\n",
      "Loading File: CleanWikiDump_part084.json\n",
      "Loading File: CleanWikiDump_part098.json\n",
      "Loading File: CleanWikiDump_part074.json\n",
      "Loading File: CleanWikiDump_part075.json\n",
      "Loading File: CleanWikiDump_part065.json\n",
      "Loading File: CleanWikiDump_part078.json\n",
      "Loading File: CleanWikiDump_part068.json\n",
      "Loading File: CleanWikiDump_part159.json\n",
      "Loading File: CleanWikiDump_part063.json\n",
      "Loading File: CleanWikiDump_part064.json\n",
      "Loading File: CleanWikiDump_part080.json\n",
      "Loading File: CleanWikiDump_part071.json\n",
      "Loading File: CleanWikiDump_part087.json\n",
      "Loading File: CleanWikiDump_part072.json\n",
      "Loading File: CleanWikiDump_part070.json\n",
      "Loading File: CleanWikiDump_part066.json\n",
      "Loading File: CleanWikiDump_part076.json\n",
      "Loading File: CleanWikiDump_part073.json\n",
      "Loading File: CleanWikiDump_part062.json\n",
      "Loading File: CleanWikiDump_part067.json\n",
      "Loading File: CleanWikiDump_part059.json\n",
      "Loading File: CleanWikiDump_part069.json\n",
      "Loading File: CleanWikiDump_part054.json\n",
      "Loading File: CleanWikiDump_part079.json\n",
      "Loading File: CleanWikiDump_part060.json\n",
      "Loading File: CleanWikiDump_part028.json\n",
      "Loading File: CleanWikiDump_part053.json\n",
      "Loading File: CleanWikiDump_part057.json\n",
      "Loading File: CleanWikiDump_part047.json\n",
      "Loading File: CleanWikiDump_part052.json\n",
      "Loading File: CleanWikiDump_part056.json\n",
      "Loading File: CleanWikiDump_part061.json\n",
      "Loading File: CleanWikiDump_part046.json\n",
      "Loading File: CleanWikiDump_part055.json\n",
      "Loading File: CleanWikiDump_part048.json\n",
      "Loading File: CleanWikiDump_part044.json\n",
      "Loading File: CleanWikiDump_part043.json\n",
      "Loading File: CleanWikiDump_part077.json\n",
      "Loading File: CleanWikiDump_part051.json\n",
      "Loading File: CleanWikiDump_part050.json\n",
      "Loading File: CleanWikiDump_part009.json\n",
      "Loading File: CleanWikiDump_part045.json\n",
      "Loading File: CleanWikiDump_part049.json\n",
      "Loading File: CleanWikiDump_part042.json\n",
      "Loading File: CleanWikiDump_part041.json\n",
      "Loading File: CleanWikiDump_part037.json\n",
      "Loading File: CleanWikiDump_part036.json\n",
      "Loading File: CleanWikiDump_part034.json\n",
      "Loading File: CleanWikiDump_part038.json\n",
      "Loading File: CleanWikiDump_part040.json\n",
      "Loading File: CleanWikiDump_part039.json\n",
      "Loading File: CleanWikiDump_part033.json\n",
      "Loading File: CleanWikiDump_part035.json\n",
      "Loading File: CleanWikiDump_part031.json\n",
      "Loading File: CleanWikiDump_part030.json\n",
      "Loading File: CleanWikiDump_part027.json\n",
      "Loading File: CleanWikiDump_part032.json\n",
      "Loading File: CleanWikiDump_part029.json\n",
      "Loading File: CleanWikiDump_part026.json\n",
      "Loading File: CleanWikiDump_part025.json\n",
      "Loading File: CleanWikiDump_part022.json\n",
      "Loading File: CleanWikiDump_part021.json\n",
      "Loading File: CleanWikiDump_part024.json\n",
      "Loading File: CleanWikiDump_part023.json\n",
      "Loading File: CleanWikiDump_part018.json\n",
      "Loading File: CleanWikiDump_part019.json\n",
      "Loading File: CleanWikiDump_part020.json\n",
      "Loading File: CleanWikiDump_part015.json\n",
      "Loading File: CleanWikiDump_part016.json\n",
      "Loading File: CleanWikiDump_part017.json\n",
      "Loading File: CleanWikiDump_part014.json\n",
      "Loading File: CleanWikiDump_part012.json\n",
      "Loading File: CleanWikiDump_part013.json\n",
      "Loading File: CleanWikiDump_part011.json\n",
      "Loading File: CleanWikiDump_part010.json\n",
      "Loading File: CleanWikiDump_part008.json\n",
      "Loading File: CleanWikiDump_part006.json\n",
      "Loading File: CleanWikiDump_part007.json\n",
      "Loading File: CleanWikiDump_part005.json\n",
      "Loading File: CleanWikiDump_part004.json\n",
      "Loading File: CleanWikiDump_part003.json\n",
      "Loading File: CleanWikiDump_part001.json\n",
      "Loading File: CleanWikiDump_part002.json\n",
      "Loading File: CleanWikiDump_part000.json\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import time\n",
    "import csv\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Connect to the Neo4j database\n",
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"12345678\"\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "# Path to the folder containing the JSON files\n",
    "json_folder = \"C:\\\\Users\\\\josep\\\\.Neo4jDesktop\\\\relate-data\\dbmss\\\\dbms-81676b45-399d-492a-b2c6-8199de366b04\\\\import\"\n",
    "\n",
    "# Create CSV writer for logging node and relationship counts\n",
    "# Check if the CSV file already exists\n",
    "csv_file = 'node_count.csv'\n",
    "if os.path.exists(csv_file):\n",
    "    # Read the last row from the CSV file and extract the time elapsed value\n",
    "    with open(csv_file, 'r', newline='') as file:\n",
    "        reader = csv.reader(file)\n",
    "        last_row = list(reader)[-1]\n",
    "        last_time = float(last_row[-1])\n",
    "    # Start the timer from where it left off\n",
    "    start_time = time.time() - last_time\n",
    "else:\n",
    "    # Create CSV writer for logging node and relationship counts\n",
    "    with open(csv_file, 'w', newline='') as file:\n",
    "        writer = csv.writer(file)\n",
    "        writer.writerow([\"FileName\", \"Nodes\", \"Relationships\", \"Time Elapsed\"])\n",
    "    # Start the timer from the beginning\n",
    "    start_time = time.time()\n",
    "    file_names = []\n",
    "    with open(csv_file, 'r') as f:\n",
    "        reader = csv.reader(f)\n",
    "        next(reader)  # skip the header row\n",
    "        for row in reader:\n",
    "            file_names.append(row[0])\n",
    "\n",
    "# Get a list of all the JSON files in the folder\n",
    "json_files = [f for f in os.listdir(json_folder) if f.endswith(\".json\")]\n",
    "json_files = sorted(json_files, key=lambda f: os.path.getsize(os.path.join(json_folder, f)))\n",
    "\n",
    "for filename in json_files:\n",
    "    if filename in file_names:\n",
    "        continue\n",
    "    with driver.session() as session:\n",
    "        print(\"Loading File: \" + filename)\n",
    "        out = session.run(\"\"\"CALL apoc.periodic.iterate(\n",
    "                    \"CALL apoc.load.json('\"\"\"+filename+\"\"\"') YIELD value\n",
    "                    WITH value\n",
    "                    UNWIND keys(value) as article_name\n",
    "                    RETURN article_name, value[article_name] as related_articles\",\n",
    "                    \"MERGE (article:Article {title: article_name})\n",
    "                    WITH article, related_articles\n",
    "                    UNWIND keys(related_articles) as related_article_name\n",
    "                    MERGE (related_article:Article {title: related_article_name})\n",
    "                    CREATE (article)-[r:LINKS_TO {position: related_articles[related_article_name]}]->(related_article)\",\n",
    "                    {batchSize: 500, parallel: false}\n",
    "                    )\n",
    "                    YIELD batches, total\n",
    "                    RETURN batches, total\"\"\")\n",
    "        #print(out)\n",
    "        # Get the number of nodes and relationships in the database\n",
    "        num_nodes = session.run(\"MATCH (n:Article) RETURN count(n)\").single()[0]\n",
    "        num_rels = session.run(\"MATCH ()-[r:LINKS_TO]->() RETURN count(r)\").single()[0]\n",
    "        # Log the file name, number of nodes, number of relationships, and current time to the CSV file\n",
    "        with open('node_count.csv', 'a', newline='') as node_file:\n",
    "            writer = csv.writer(node_file)\n",
    "            writer.writerow([filename, num_nodes, num_rels, time.time() - start_time])\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loading File: CleanWikiDump_part000.json\n",
      "Loading File: CleanWikiDump_part001.json\n",
      "Loading File: CleanWikiDump_part002.json\n",
      "Loading File: CleanWikiDump_part003.json\n",
      "Loading File: CleanWikiDump_part004.json\n",
      "Loading File: CleanWikiDump_part005.json\n",
      "Loading File: CleanWikiDump_part006.json\n",
      "Loading File: CleanWikiDump_part007.json\n",
      "Loading File: CleanWikiDump_part008.json\n",
      "Loading File: CleanWikiDump_part009.json\n",
      "Loading File: CleanWikiDump_part010.json\n",
      "Loading File: CleanWikiDump_part011.json\n",
      "Loading File: CleanWikiDump_part012.json\n",
      "Loading File: CleanWikiDump_part013.json\n",
      "Loading File: CleanWikiDump_part014.json\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import json\n",
    "import time\n",
    "import csv\n",
    "from neo4j import GraphDatabase\n",
    "from threading import Thread\n",
    "\n",
    "# Connect to Neo4j database\n",
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"Wikipedia\"\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "# Path to the folder containing the JSON files\n",
    "json_folder = \"D:\\Wiki\\CleanWikiSplit\"\n",
    "\n",
    "# Create CSV writer for logging node and relationship counts\n",
    "with open('node_count.csv', 'w', newline='') as file:\n",
    "    writer = csv.writer(file)\n",
    "    writer.writerow([\"Batch Number\", \"Nodes\", \"Relationships\", \"Time Elapsed\"])\n",
    "\n",
    "# Number of files to process in each batch\n",
    "batch_size = 10\n",
    "\n",
    "# Get a list of all the JSON files in the folder\n",
    "json_files = [f for f in os.listdir(json_folder) if f.endswith(\".json\")]\n",
    "\n",
    "# Split the list of files into batches\n",
    "file_batches = [json_files[i:i + batch_size] for i in range(0, len(json_files), batch_size)]\n",
    "\n",
    "# Create a function to process a batch of files\n",
    "def process_batch(batch):\n",
    "    # Create a session to execute Neo4j queries\n",
    "    with driver.session() as session:\n",
    "        # Loop through all the files in the batch\n",
    "        for filename in batch:\n",
    "            json_path = os.path.join(json_folder, filename)\n",
    "            print(\"Loading File: \" + filename)\n",
    "\n",
    "            # Open the JSON file and load the data\n",
    "            with open(json_path, encoding='utf-8') as json_file:\n",
    "                data = json.load(json_file)\n",
    "\n",
    "            # Loop through all the articles in the JSON data\n",
    "            for title, links in data.items():\n",
    "                session.run(\"CREATE (b:Article {title: $title})\", title=title.lower())\n",
    "                position = 0\n",
    "                for link, count in links.items():\n",
    "                    position += 1\n",
    "                    session.run(\"CREATE (b:Article {title: $title})\", title=link.lower())\n",
    "                    session.run(\"\"\"\n",
    "                    MATCH (a:Article {title: $title}) MATCH (b:Article {title: $link_title}) \n",
    "                    CREATE (a)-[r:LINKS_TO {count: $count, position: $position}]->(b)\"\"\"\n",
    "                                , title=title.lower(), link_title=link.lower(), count=count, position=position)\n",
    "    session.close()\n",
    "\n",
    "# Start the timer\n",
    "start_time = time.time()\n",
    "\n",
    "# Loop through all the batches of files\n",
    "batchcount = 0\n",
    "for batch in file_batches:\n",
    "    batchcount = batchcount + 1\n",
    "    # Create a list of threads to process the batch\n",
    "    threads = []\n",
    "    for filename in batch:\n",
    "        thread = Thread(target=process_batch, args=([filename],))\n",
    "        threads.append(thread)\n",
    "\n",
    "    # Start the threads\n",
    "    for thread in threads:\n",
    "        thread.start()\n",
    "\n",
    "    # Wait for all the threads to finish\n",
    "    for thread in threads:\n",
    "        thread.join()\n",
    "\n",
    "    with driver.session() as session:\n",
    "        # Get the number of nodes and relationships in the database\n",
    "        num_nodes = session.run(\"MATCH (n:Article) RETURN count(n)\").single()[0]\n",
    "        num_rels = session.run(\"MATCH ()-[r:LINKS_TO]->() RETURN count(r)\").single()[0]\n",
    "\n",
    "        # Log the file name, number of nodes, number of relationships, and current time to the CSV file\n",
    "        with open('node_count.csv', 'a', newline='') as node_file:\n",
    "                writer = csv.writer(node_file)\n",
    "                writer.writerow([batchcount, num_nodes, num_rels, time.time() - start_time])\n",
    "    session.close()\n",
    "\n",
    "# Close the Neo4j driver\n",
    "driver.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.2"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "8008c7938f0b86996fe1a6c007fe44f044e127b2c6c62467d3c523c2aca5bff7"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
